In [3]:
import pandas as pd

In [3]:
df1 = pd.DataFrame([[1, 2, 3], [4, 5, 6]])
df1

   0  1  2
0  1  2  3
1  4  5  6

In [2]:
pd.DataFrame()
pd.Series()

Series([], dtype: object)

In [5]:
df1 = pd.DataFrame([{'col1' : 1, 'col2': 2}, {'col1': 1, 'col2': 2}])
df1

   col1  col2
0     1     2
1     1     2

In [11]:
df2 = pd.DataFrame({'col1' : [1,2], 'col2': [3,4]})
df2

   col1  col2
0     1     3
1     2     4

In [12]:
df3 = pd.DataFrame({'col1' : {'row1': 1, 'row2': 2}, 'col2': {'row1': 3, 'row2': 4}})
df3

      col1  col2
row1     1     3
row2     2     4

In [15]:
df3['col1'] # ==df3.col1

row1    1
row2    2
Name: col1, dtype: int64

In [14]:
df3.col1

row1    1
row2    2
Name: col1, dtype: int64

In [ ]:
# pd.remame()

In [16]:
df3.loc['row1']

col1    1
col2    3
Name: row1, dtype: int64

In [17]:
type(df3.loc['row1'])

pandas.core.series.Series

In [ ]:
# Матрица как список списков

In [18]:
print(*[[1, 2], [3, 4]], sep='\n')

[1, 2]
[3, 4]

In [ ]:
# Списки в питоне не оптимально работают в плане скорости и занимаемой памяти

In [19]:
df3.loc['row1', 'col1']

1

In [ ]:
df3.loc[:, 'col1'] #L[:] - весь список от начала до конца

In [20]:
df3.loc[:, :]

      col1  col2
row1     1     3
row2     2     4

In [21]:
df3.iloc[1]

col1    2
col2    4
Name: row2, dtype: int64

In [ ]:
# У нас вывелся второй ряд (по индексу), нам не пришлось прописывать название

In [22]:
df3.iloc[:, 0]

row1    1
row2    2
Name: col1, dtype: int64

In [4]:
data = pd.read_csv('data_sem6.csv', sep = ';')

In [27]:
data.head(1) # первые .. строк

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.25,NaN,S

In [28]:
data.tail(1) # последние .. строк

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
890,891,0,3,Dooley; Mr. Patrick,male,32.0,0,0,370376,7.75,NaN,Q

In [29]:
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,Montvila; Rev. Juozas,male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,Graham; Miss. Margaret Edith,female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston; Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,Behr; Mr. Karl Howell,male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,Dooley; Mr. Patrick,male,32.0,0,0,370376,7.7500,NaN,Q

In [30]:
data.sample(3) # вернет ... случайных рандомных строк

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
492,493,0,1,Molson; Mr. Harry Markland,male,55.0,0,0,113787,30.5000,C30,S
502,503,0,3,O'Sullivan; Miss. Bridget Mary,female,NaN,0,0,330909,7.6292,NaN,Q
199,200,0,2,"Yrois; Miss. Henriette (""Mrs Harbeck"")",female,24.0,0,0,248747,13.0000,NaN,S

In [31]:
data.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [32]:
data.index

RangeIndex(start=0, stop=891, step=1)

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [ ]:
# сколько ячеек заполнены non null

In [34]:
data.isna().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [ ]:
# возвр True если хотя б в одной ячейке пропуск

In [14]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [ ]:
pd.read_json() # словарь словарей, списков, список списков

In [ ]:
pip install openpyxl #xlsx
# xls

In [ ]:
pd.read_excel()

In [36]:
data[['Survived', 'Pclass']]

     Survived  Pclass
0           0       3
1           1       1
2           1       3
3           1       1
4           0       3
..        ...     ...
886         0       2
887         1       1
888         0       3
889         1       1
890         0       3

[891 rows x 2 columns]

In [37]:
data[data.Survived == 1]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,Johnson; Mrs. Oscar W (Elisabeth Vilhelmina Berg),female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,Nasser; Mrs. Nicholas (Adele Achem),female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
875,876,1,3,"Najib; Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,Potter; Mrs. Thomas Jr (Lily Alexenia Wilson),female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,Shelley; Mrs. William (Imanita Parrish Hall),female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,Graham; Miss. Margaret Edith,female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,Behr; Mr. Karl Howell,male,26.0,0,0,111369,30.0000,C148,C

In [38]:
data[data.Survived == 1].head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,Johnson; Mrs. Oscar W (Elisabeth Vilhelmina Berg),female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,Nasser; Mrs. Nicholas (Adele Achem),female,14.0,1,0,237736,30.0708,NaN,C

In [39]:
data[(data.Survived == 1) & (data.Sex == 'female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S
8,9,1,3,Johnson; Mrs. Oscar W (Elisabeth Vilhelmina Berg),female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,Nasser; Mrs. Nicholas (Adele Achem),female,14.0,1,0,237736,30.0708,NaN,C
...,...,...,...,...,...,...,...,...,...,...,...,...
874,875,1,2,Abelson; Mrs. Samuel (Hannah Wizosky),female,28.0,1,0,P/PP 3381,24.0000,NaN,C
875,876,1,3,"Najib; Miss. Adele Kiamie ""Jane""",female,15.0,0,0,2667,7.2250,NaN,C
879,880,1,1,Potter; Mrs. Thomas Jr (Lily Alexenia Wilson),female,56.0,0,1,11767,83.1583,C50,C
880,881,1,2,Shelley; Mrs. William (Imanita Parrish Hall),female,25.0,0,1,230433,26.0000,NaN,S
887,888,1,1,Graham; Miss. Margaret Edith,female,19.0,0,0,112053,30.0000,B42,S

In [40]:
len(data)

891

In [41]:
set(data.Sex)

{'female', 'male', 'unknown'}

In [42]:
data.Sex.unique()

array(['male', 'female', 'unknown'], dtype=object)

In [43]:
data.Sex.value_counts()

Sex
male       574
female     312
unknown      5
Name: count, dtype: int64

In [46]:
# mean, sum, count агрегация

In [45]:
data.Pclass.sum()

2057

In [ ]:
data.drop(0) # дропнуть строку

In [ ]:
# возвр копию, если обратиться, он все равно вернет 0 строку

In [47]:
data.drop('Cabin', axis = 1, inplace = True) # дропнуть столбец (это ось 1)

In [48]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,S
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,S
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,S
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,S

In [53]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(4)
memory usage: 76.7+ KB

In [5]:
data = pd.read_csv('data_sem6.csv', sep = ';')

In [51]:
data.drop('Cabin', axis = 1, inplace = True) # дропнуть столбец (это ось 1)

In [52]:
data.Age.fillna(data.Age.mean()) # Заменить пропуски с возрастом на средний возраст

0      22.000000
1      38.000000
2      26.000000
3      35.000000
4      35.000000
         ...
886    27.000000
887    19.000000
888    29.699118
889    26.000000
890    32.000000
Name: Age, Length: 891, dtype: float64

In [54]:
data.drop_duplicates(keep='first', inplace = True)

In [55]:
df2

   col1  col2
0     1     3
1     2     4

In [56]:
df2.loc[2]

KeyError: 2

In [57]:
df2.loc[2] = [5, 6]

In [58]:
df2

   col1  col2
0     1     3
1     2     4
2     5     6

In [ ]:
df2['col3'] = pd.Series([7, 8, 9])

In [59]:
data['Surname'] = data.Name.apply(lambda s: s.split(';')[0])

In [60]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Embarked,Surname
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,S,Braund
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C,Cumings
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,S,Heikkinen
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,S,Futrelle
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,S,Allen

In [61]:
len(set(data.Surname))

667

In [6]:
data.groupby('Sex').mean()

TypeError: agg function failed [how->mean,dtype->object]

In [8]:
import numpy as np
pd.pivot_table(data, index=['Sex', 'Pclass'], values=['Age'], columns=['Survived'], aggfunc=np.mean)

C:\Users\Кристина\AppData\Local\Temp\ipykernel_13352\766144567.py:2: FutureWarning: The provided callable <function mean at 0x000001E54CCAC160> is currently using DataFrameGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(data, index=['Sex', 'Pclass'], values=['Age'], columns=['Survived'], aggfunc=np.mean)

                      Age
Survived                0          1
Sex     Pclass
female  1       25.666667  34.939024
        2       36.000000  28.080882
        3       23.925926  19.329787
male    1       44.581967  36.248000
        2       33.369048  17.107143
        3       27.200935  22.274211
unknown 2             NaN   0.830000
        3       28.500000        NaN

In [ ]:
# У меня новая версия pd, поэтому mean не работает, надо дропнуть все числовые колонки

In [7]:
data[['Survived', 'Pclass']].groupby('Sex').mean()

KeyError: 'Sex'

In [ ]:
# Как сохранить
data.to_csv('...csv')
data.to_excell('...')
data.to_json('...json')

In [ ]:
# Кол-во выжвших и погибших

In [10]:
len(data[(data.Survived == 1)])

342

In [11]:
len(data[(data.Survived == 0)])

549

In [12]:
data.Survived.value_counts()

Survived
0    549
1    342
Name: count, dtype: int64

In [ ]:
# Создайте столбец "IsChild", который равен 1, если возраст меньше 20, и 0 иначе. 
# Для пропущенных значений поведение функции может быть произвольным.

In [17]:
data['IsChild'] = data.Age.apply(lambda age: 1 if age < 20 else 0)

In [18]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,IsChild
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S,0
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S,0

In [19]:
data.IsChild.value_counts()

IsChild
0    727
1    164
Name: count, dtype: int64

In [ ]:
#Какова доля выживших женщин из первого класса? А доля выживших мужчин из 3 класса?

In [28]:
len(data[(data.Survived == 1) & (data.Sex == 'female') & (data.Pclass == 1)]) / len(data[(data.Survived == 1)])

0.26608187134502925

In [29]:
len(data[(data.Survived == 1) & (data.Sex == 'male') & (data.Pclass == 3)]) / len(data[(data.Survived == 1)])

0.13742690058479531

In [ ]:
#Какова доля выживших пассажиров из класса 3? А пассажиров из класса 1?

In [24]:
len(data[(data.Survived == 1) & (data.Pclass == 3)]) / len(data[(data.Survived == 1)])

0.347953216374269

In [25]:
len(data[(data.Survived == 1) & (data.Pclass == 1)]) / len(data[(data.Survived == 1)])

0.39766081871345027

In [26]:
len(data[(data.Survived == 1) & (data.Pclass == 2)]) / len(data[(data.Survived == 1)])

0.2543859649122807

In [ ]:
#Какова доля семей, в которых минимальный возраст меньше 20 (семьи с детьми)?

In [30]:
data['Surname'] = data.Name.apply(lambda s: s.split(';')[0])

In [31]:
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,IsChild,Surname
0,1,0,3,Braund; Mr. Owen Harris,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,Braund
1,2,1,1,Cumings; Mrs. John Bradley (Florence Briggs Th...,female,38.0,1,0,PC 17599,71.2833,C85,C,0,Cumings
2,3,1,3,Heikkinen; Miss. Laina,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,Heikkinen
3,4,1,1,Futrelle; Mrs. Jacques Heath (Lily May Peel),female,35.0,1,0,113803,53.1000,C123,S,0,Futrelle
4,5,0,3,Allen; Mr. William Henry,male,35.0,0,0,373450,8.0500,NaN,S,0,Allen

In [35]:
len(data.Surname.unique())

667

In [38]:
len(data[(data.IsChild == 1)])

164

In [39]:
len(data[(data.IsChild == 1)]) / len(data.Surname.unique())

0.24587706146926536

In [ ]:
# А если в семье не один ребенок? Создать общую колонку Фамилия + Является Ребенком